Revit 2027 API
EnergyAnalysisZone.CoolingSetPoint Property
 The cooling temperature set point in unit Kelvin (K).
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double CoolingSetPoint { get; }
Public ReadOnly Property CoolingSetPoint As Double
	Get
public:
property double CoolingSetPoint {
	double get ();
}
member CoolingSetPoint : float with get
Property Value
Double
See Also
Reference
EnergyAnalysisZone Class
Autodesk.Revit.DB.Analysis Namespace